In [0]:
from google.colab import files
upload=files.upload()
for fn in upload.keys():
  print('User upload files "{name}" with length {length} bytes'.format(name=fn,length=len(upload[fn])))

Saving titanic_data.csv to titanic_data.csv
User upload files "titanic_data.csv" with length 61194 bytes

In [0]:
import pandas as pd
import numpy as np
from pandas import DataFrame,Series

#Chap 6数据格式加载

In [0]:
table=pd.read_csv("titanic_data.csv")
table

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

##查询缺失值

In [0]:
pd.isnull(table)

     PassengerId  Survived  Pclass   Name  ...  Ticket   Fare  Cabin  Embarked
0          False     False   False  False  ...   False  False   True     False
1          False     False   False  False  ...   False  False  False     False
2          False     False   False  False  ...   False  False   True     False
3          False     False   False  False  ...   False  False  False     False
4          False     False   False  False  ...   False  False   True     False
..           ...       ...     ...    ...  ...     ...    ...    ...       ...
886        False     False   False  False  ...   False  False   True     False
887        False     False   False  False  ...   False  False  False     False
888        False     False   False  False  ...   False  False   True     False
889        False     False   False  False  ...   False  False  False     False
890        False     False   False  False  ...   False  False   True     False

[891 rows x 12 columns]

##读取处理

In [0]:
sample=pd.read_csv('titanic_data.csv',nrows=10)
sample

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

In [0]:
chunker = pd.read_csv('titanic_data.csv', chunksize=100)

tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['Age'].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)
tot[:10]

24.00    30.0
22.00    27.0
18.00    26.0
30.00    25.0
19.00    25.0
         ...
64.00     2.0
0.75      2.0
70.00     2.0
71.00     2.0
10.00     2.0
Length: 72, dtype: float64

##输出结果

In [0]:
sample.to_csv('example.cvs')
! cat example.cvs

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.05,,S
5,6,0,3,"Moran, Mr. James",male,,0,0,330877,8.4583,,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.075,,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,,C

In [0]:
import sys

In [0]:
sample.to_csv(sys.stdout, sep='|')

|PassengerId|Survived|Pclass|Name|Sex|Age|SibSp|Parch|Ticket|Fare|Cabin|Embarked
0|1|0|3|Braund, Mr. Owen Harris|male|22.0|1|0|A/5 21171|7.25||S
1|2|1|1|Cumings, Mrs. John Bradley (Florence Briggs Thayer)|female|38.0|1|0|PC 17599|71.2833|C85|C
2|3|1|3|Heikkinen, Miss. Laina|female|26.0|0|0|STON/O2. 3101282|7.925||S
3|4|1|1|Futrelle, Mrs. Jacques Heath (Lily May Peel)|female|35.0|1|0|113803|53.1|C123|S
4|5|0|3|Allen, Mr. William Henry|male|35.0|0|0|373450|8.05||S
5|6|0|3|Moran, Mr. James|male||0|0|330877|8.4583||Q
6|7|0|1|McCarthy, Mr. Timothy J|male|54.0|0|0|17463|51.8625|E46|S
7|8|0|3|Palsson, Master. Gosta Leonard|male|2.0|3|1|349909|21.075||S
8|9|1|3|Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)|female|27.0|0|2|347742|11.1333||S
9|10|1|2|Nasser, Mrs. Nicholas (Adele Achem)|female|14.0|1|0|237736|30.0708||C

In [0]:
sample.to_csv(sys.stdout,na_rep='Null',index=False,header=False)

1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,Null,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,Null,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.05,Null,S
6,0,3,"Moran, Mr. James",male,Null,0,0,330877,8.4583,Null,Q
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.075,Null,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,Null,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,Null,C

##处理分隔符格式+创建数据字典

In [0]:
import csv

In [0]:
f=open('titanic_data.csv')
reader=csv.reader(f)
type(reader)

_csv.reader

In [0]:
for line in reader:
  print(line)

In [0]:
with open('titanic_data.csv') as f:
  lines=list(csv.reader(f))
header,value=lines[0],lines[1:]
data_dict={h: v for h, v in zip(header,zip(*value))}
data_dict

##处理json

In [0]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [0]:
import json

In [0]:
result=json.loads(obj)
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [0]:
siblings=pd.DataFrame(result['siblings'])
siblings

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

##Web API
example:为了搜索最新的30个GitHub上的pandas主题，我们可以发一个HTTP GET请求，使用requests扩展库

In [0]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp=requests.get(url)
resp

In [0]:
data=resp.json()
data[0]['title']

'REF: share benchmark code'

In [0]:
issue=pd.DataFrame(data,columns=['number','title','labels','state'])
issue
#data中的每个元素都是一个包含所有GitHub主题页数据（不包含评论）的字典

    number  ... state
0    32210  ...  open
1    32209  ...  open
2    32208  ...  open
3    32207  ...  open
4    32206  ...  open
5    32205  ...  open
6    32204  ...  open
7    32203  ...  open
8    32202  ...  open
9    32198  ...  open
10   32197  ...  open
11   32195  ...  open
12   32194  ...  open
13   32190  ...  open
14   32188  ...  open
15   32187  ...  open
16   32185  ...  open
17   32183  ...  open
18   32182  ...  open
19   32180  ...  open
20   32179  ...  open
21   32177  ...  open
22   32174  ...  open
23   32173  ...  open
24   32172  ...  open
25   32166  ...  open
26   32164  ...  open
27   32163  ...  open
28   32162  ...  open
29   32157  ...  open

[30 rows x 4 columns]

##数据库交互

In [0]:
#package: sqlalchemy, sqlite3

#Chap7数据预处理

##处理缺失数据
dropna,ffillna,isnull,notnull

In [0]:
string_data=pd.Series(['aajsdnfkj','jidnjfskn',np.nan,'avacado'])
string_data

0    aajsdnfkj
1    jidnjfskn
2          NaN
3      avacado
dtype: object

In [0]:
string_data.isnull()
#NAN和Python内置的None值在对象数组中也可以作为NA

0    False
1    False
2     True
3    False
dtype: bool

In [0]:
string_data[0]=None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

当进行数据清洗以进行分析时，最好直接对缺失数据进行分析，以判断数据采集的问题或缺失数据可能导致的偏差。

In [0]:
#筛去带缺失值的数据
string_data.dropna()

0    aajsdnfkj
1    jidnjfskn
3      avacado
dtype: object

In [0]:
#等价于 
print(string_data.notnull())
string_data[string_data.notnull()]

0     True
1     True
2    False
3     True
dtype: bool

0    aajsdnfkj
1    jidnjfskn
3      avacado
dtype: object

In [0]:
#DataFrame
from numpy import NaN as NA
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [0]:
print(data.notnull())
cleaned=data[data.notnull()]
cleaned
#notnull只能用于筛选Series不能用于Dataframe

       0      1      2
0   True   True   True
1   True  False  False
2  False  False  False
3  False   True   True

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [0]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [0]:
#传入how='all'将只丢弃全为NA
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [0]:
#滤除DataFrame行的问题涉及时间序列数据。假设你只想留下一部分观测数据，可以用thresh
df=pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  0.421749 -0.559052 -0.821248 -0.064011
1  0.751781  0.323055  1.104733 -0.894587
2  3.333686 -2.444529 -0.082886  0.403482
3 -3.277324 -0.538956  0.547566 -1.214311
4  0.194885  0.497077 -0.503881 -0.590730
5 -0.886484  0.453436  0.432231 -0.797130
6 -1.300640  1.663771  0.004389  0.873726
7  1.251130  0.948143 -1.671664 -0.878781
8  1.053507 -0.091205  0.398171  0.510390
9 -0.977449  0.620781  0.042819 -0.857257

In [0]:
df.iloc[:4,2]=NA
df.iloc[:2,3]=NA
df

          0         1         2         3
0  0.421749 -0.559052       NaN       NaN
1  0.751781  0.323055       NaN       NaN
2  3.333686 -2.444529       NaN  0.403482
3 -3.277324 -0.538956       NaN -1.214311
4  0.194885  0.497077 -0.503881 -0.590730
5 -0.886484  0.453436  0.432231 -0.797130
6 -1.300640  1.663771  0.004389  0.873726
7  1.251130  0.948143 -1.671664 -0.878781
8  1.053507 -0.091205  0.398171  0.510390
9 -0.977449  0.620781  0.042819 -0.857257

In [0]:
df.dropna()

          0         1         2         3
4  0.194885  0.497077 -0.503881 -0.590730
5 -0.886484  0.453436  0.432231 -0.797130
6 -1.300640  1.663771  0.004389  0.873726
7  1.251130  0.948143 -1.671664 -0.878781
8  1.053507 -0.091205  0.398171  0.510390
9 -0.977449  0.620781  0.042819 -0.857257

In [0]:
#传入thresh=n保留至少有n个非NaN数据的行
df.dropna(thresh=3)

          0         1         2         3
2  3.333686 -2.444529       NaN  0.403482
3 -3.277324 -0.538956       NaN -1.214311
4  0.194885  0.497077 -0.503881 -0.590730
5 -0.886484  0.453436  0.432231 -0.797130
6 -1.300640  1.663771  0.004389  0.873726
7  1.251130  0.948143 -1.671664 -0.878781
8  1.053507 -0.091205  0.398171  0.510390
9 -0.977449  0.620781  0.042819 -0.857257

In [0]:
#填充缺失值
data.fillna(value=0)

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.0

In [0]:
#通过一个字典调用fillna，就可以实现对不同的列填充不同的值
data.fillna({0:0.1,1:0.2,2:0.3})

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.2  0.3
2  0.1  0.2  0.3
3  0.1  6.5  3.0

In [0]:
#fillna与reindexing的相似用法
df

          0         1         2         3
0  0.421749 -0.559052       NaN       NaN
1  0.751781  0.323055       NaN       NaN
2  3.333686 -2.444529       NaN  0.403482
3 -3.277324 -0.538956       NaN -1.214311
4  0.194885  0.497077 -0.503881 -0.590730
5 -0.886484  0.453436  0.432231 -0.797130
6 -1.300640  1.663771  0.004389  0.873726
7  1.251130  0.948143 -1.671664 -0.878781
8  1.053507 -0.091205  0.398171  0.510390
9 -0.977449  0.620781  0.042819 -0.857257

In [0]:
df.fillna(method='bfill')

          0         1         2         3
0  0.421749 -0.559052 -0.503881  0.403482
1  0.751781  0.323055 -0.503881  0.403482
2  3.333686 -2.444529 -0.503881  0.403482
3 -3.277324 -0.538956 -0.503881 -1.214311
4  0.194885  0.497077 -0.503881 -0.590730
5 -0.886484  0.453436  0.432231 -0.797130
6 -1.300640  1.663771  0.004389  0.873726
7  1.251130  0.948143 -1.671664 -0.878781
8  1.053507 -0.091205  0.398171  0.510390
9 -0.977449  0.620781  0.042819 -0.857257

In [0]:
df.fillna(method='bfill',limit=1)

          0         1         2         3
0  0.421749 -0.559052       NaN       NaN
1  0.751781  0.323055       NaN  0.403482
2  3.333686 -2.444529       NaN  0.403482
3 -3.277324 -0.538956 -0.503881 -1.214311
4  0.194885  0.497077 -0.503881 -0.590730
5 -0.886484  0.453436  0.432231 -0.797130
6 -1.300640  1.663771  0.004389  0.873726
7  1.251130  0.948143 -1.671664 -0.878781
8  1.053507 -0.091205  0.398171  0.510390
9 -0.977449  0.620781  0.042819 -0.857257

In [0]:
#传入Series的平均值或中位数：
S2=df[2].mean()
S3=df[3].mean()
df.fillna({2:S2,3:S3})

          0         1         2         3
0  0.421749 -0.559052 -0.216322 -0.318826
1  0.751781  0.323055 -0.216322 -0.318826
2  3.333686 -2.444529 -0.216322  0.403482
3 -3.277324 -0.538956 -0.216322 -1.214311
4  0.194885  0.497077 -0.503881 -0.590730
5 -0.886484  0.453436  0.432231 -0.797130
6 -1.300640  1.663771  0.004389  0.873726
7  1.251130  0.948143 -1.671664 -0.878781
8  1.053507 -0.091205  0.398171  0.510390
9 -0.977449  0.620781  0.042819 -0.857257

In [0]:
data  #都不会改动原数据
#inplace默认False,返回新对象， 如果改为True,则修改原数据

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

##数据转换

###移除重复数据

In [0]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [0]:
#表示各行是否是重复行（前面出现过的行）
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [0]:
#重复的数据为False，只筛回是True的非重复值，返回DataFrame
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [0]:
#这两个方法默认会判断全部列，你也可以指定部分列进行重复项判断。
data["v1"]=range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [0]:
#只按照K1列筛选重复值
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [0]:
#duplicated和drop_duplicates默认保留的是第一个出现的值组合。传入keep='last'则保留最后一个
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

###利用函数或映射进行数据转换

In [0]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [0]:
#添加一列表示该肉类食物来源的动物类型
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [0]:
#转换大小写
lowercased=data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [0]:
#Series的map方法可以接受一个函数或含有映射关系的字典型对象
data['animal']=lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [0]:
#或者使用函数
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

###替换值

In [0]:
#replace
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [0]:
data.replace(-999,NA)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [0]:
data.replace([-999,-1000],[0,NA])

0    1.0
1    0.0
2    2.0
3    0.0
4    NaN
5    3.0
dtype: float64

###重命名轴索引
跟Series中的值一样，轴标签也可以通过函数或映射进行转换，从而得到一个新的不同标签的对象。轴还可以被就地修改，而无需新建一个数据结构。

In [0]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [0]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [0]:
transform=lambda x: x[:4].upper()#取前4位字母并大写
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [0]:
data.index=data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [0]:
#rename可以结合字典型对象实现对部分轴标签的更新
data.rename(index={'OHIO': 'INDIANA'},columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

###离散化和面元划分
为了便于分析，连续数据常常被离散化或拆分为“面元”（bin）

In [0]:
#假设有一组人员数据，而你希望将它们划分为不同的年龄组：
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32,18]
bin=[18,25,35,60,100]
groups=pd.cut(ages,bin)
groups

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (60.0, 100.0], (35.0, 60.0], (35.0, 60.0], (25.0, 35.0], NaN]
Length: 13
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

pandas返回的是一个特殊的**Categorical**对象。结果展示了pandas.cut划分的面元。你可以将其看做一组表示面元名称的字符串。

In [0]:
#它的底层含有一个表示不同分类名称的类型数组，以及一个codes属性中的年龄数据的标签
groups.codes

array([ 0,  0,  0,  1,  0,  0,  2,  1,  3,  2,  2,  1, -1], dtype=int8)

In [0]:
groups.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [0]:
#pd.value_counts(cats)是pandas.cut结果的面元计数,只计在range范围内的
pd.value_counts(groups)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

 跟“区间”的数学符号一样，圆括号表示开端，而方括号则表示闭端（包括）。哪边是闭端可以通过right=False进行修改

In [0]:
pd.cut(ages,[18,26,36,51,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [51, 100), [36, 51), [36, 51), [26, 36), [18, 26)]
Length: 13
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 51) < [51, 100)]

In [0]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages,bin,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., Senior, MiddleAged, MiddleAged, YoungAdult, NaN]
Length: 13
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [0]:
#cut传入的是面元的数量而不是确切的面元边界，则它会根据数据的最小值和最大值计算等长面元。
data=np.random.randn(20)
data
pd.cut(data,4,precision=2)#precision=2，限定小数只有两位

[(-0.51, 0.21], (-1.24, -0.51], (-1.24, -0.51], (0.21, 0.94], (0.21, 0.94], ..., (-0.51, 0.21], (0.94, 1.67], (-0.51, 0.21], (-0.51, 0.21], (0.21, 0.94]]
Length: 20
Categories (4, interval[float64]): [(-1.24, -0.51] < (-0.51, 0.21] < (0.21, 0.94] < (0.94, 1.67]]

qcut是一个非常类似于cut的函数，它可以根据样本分位数对数据进行面元划分。根据数据的分布情况，cut可能无法使各个面元中含有相同数量的数据点。而qcut由于使用的是样本分位数，因此可以得到大小基本相等的面元

In [0]:
#qcut是划分分位数，cut是按照range等间距划分
data=np.random.randn(1000)
group=pd.qcut(data,4)
group

[(-0.624, 0.0236], (0.0236, 0.719], (0.0236, 0.719], (-0.624, 0.0236], (0.0236, 0.719], ..., (0.0236, 0.719], (-3.387, -0.624], (-3.387, -0.624], (0.0236, 0.719], (-3.387, -0.624]]
Length: 1000
Categories (4, interval[float64]): [(-3.387, -0.624] < (-0.624, 0.0236] < (0.0236, 0.719] <
                                    (0.719, 3.438]]

In [0]:
pd.value_counts(group)

(0.719, 3.438]      250
(0.0236, 0.719]     250
(-0.624, 0.0236]    250
(-3.387, -0.624]    250
dtype: int64

In [0]:
#qcut 可以自定义分位数值
group=pd.qcut(data,[0,0.1,0.5,0.9,1])
group

[(-1.236, 0.0236], (0.0236, 1.28], (0.0236, 1.28], (-1.236, 0.0236], (0.0236, 1.28], ..., (0.0236, 1.28], (-3.387, -1.236], (-1.236, 0.0236], (0.0236, 1.28], (-1.236, 0.0236]]
Length: 1000
Categories (4, interval[float64]): [(-3.387, -1.236] < (-1.236, 0.0236] < (0.0236, 1.28] <
                                    (1.28, 3.438]]

In [0]:
pd.value_counts(group).sort_index()

(-3.387, -1.236]    100
(-1.236, 0.0236]    400
(0.0236, 1.28]      400
(1.28, 3.438]       100
dtype: int64

###检测和过滤异常值
过滤或变换异常值（outlier）在很大程度上就是运用数组运算。

In [0]:
data=pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.044945     0.012869    -0.036753     0.022419
std       1.001063     1.024889     0.983406     1.007265
min      -3.418732    -3.495684    -3.515613    -2.986887
25%      -0.682006    -0.678489    -0.728864    -0.648789
50%      -0.047960     0.001762    -0.030181    -0.009122
75%       0.599620     0.686622     0.698601     0.652127
max       4.489767     3.152258     2.803687     3.667368

In [0]:
#找出某列中绝对值大小超过3的值
col=data[2]
col[np.abs(col)>3]

421   -3.379297
429   -3.515613
Name: 2, dtype: float64

In [0]:
#全部含有“超过3或－3的值”的行，你可以在布尔型DataFrame中使用any方法：
data[(np.abs(data)>3).any(1)]

            0         1         2         3
236 -3.418732 -1.223856  0.101164 -1.495396
421  0.406075  3.012279 -3.379297 -0.100958
429 -0.236664 -1.227203 -3.515613 -1.737707
439  0.407814  0.157046  0.089032  3.183836
460  3.459599  0.728942  1.079423 -0.533720
501  4.489767 -0.020058 -1.251054  0.338843
507 -2.185445 -3.108290 -0.048893  1.641104
589 -3.222226 -1.179872 -1.007878  1.667998
698  0.614448  3.112561  0.004689 -1.027346
736 -1.233924 -1.741835  0.800188  3.667368
785 -1.442148 -3.495684  0.373777  0.270360
791 -0.334067  0.926357 -0.465884  3.237826
937 -3.244178  0.280646  0.976125 -0.176020
999 -0.460486  3.152258 -0.968802 -1.037262

In [0]:
#将值限制在区间－3到3以内：
data[np.abs(data)>3]=np.sign(data)*3  #根据数据的值是正还是负，np.sign(data)可以生成1和-1
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.046009     0.013196    -0.035858     0.021330
std       0.991104     1.022156     0.980493     1.003770
min      -3.000000    -3.000000    -3.000000    -2.986887
25%      -0.682006    -0.678489    -0.728864    -0.648789
50%      -0.047960     0.001762    -0.030181    -0.009122
75%       0.599620     0.686622     0.698601     0.652127
max       3.000000     3.000000     2.803687     3.000000

###排列和随机采样

In [0]:
df=pd.DataFrame(np.arange(20).reshape(5,4))
#随机排序
sampler=np.random.permutation(5)
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [0]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
0   0   1   2   3
3  12  13  14  15
4  16  17  18  19

In [0]:
#随机选取
df.sample(n=3)

   0  1   2   3
1  4  5   6   7
0  0  1   2   3
2  8  9  10  11

In [0]:
#替换的方式产生样本
choice=pd.Series([5,7,-1,0,4,6])
draws=choice.sample(n=10,replace=True) #replace=True允许重复选择)
draws

1    7
1    7
0    5
0    5
4    4
0    5
4    4
0    5
0    5
3    0
dtype: int64

In [0]:
#数字化categorical variable
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [0]:
#如果DataFrame的某一列中含有k个不同的值，则可以派生出一个k列矩阵或DataFrame（其值全为1和0）
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [0]:
dummies=pd.get_dummies(df['key'],prefix='key')
df_with_dumies=df[['data1']].join(dummies)#df['data1']为Series,df[['data1']]为Dataframe
df_with_dumies

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [0]:
#如果DataFrame中的某行同属于多个分类，则事情就会有点复杂
np.random.seed(12345)#numpy.random.seed，使这个例子具有确定性
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [0]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.cut(values,bins)

[(0.8, 1.0], (0.2, 0.4], (0.0, 0.2], (0.2, 0.4], (0.4, 0.6], (0.4, 0.6], (0.8, 1.0], (0.6, 0.8], (0.6, 0.8], (0.6, 0.8]]
Categories (5, interval[float64]): [(0.0, 0.2] < (0.2, 0.4] < (0.4, 0.6] < (0.6, 0.8] < (0.8, 1.0]]

In [0]:
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

##字符串对象方法

In [0]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [0]:
#split常常与strip一起使用，以去除空白符（包括换行符）
pieces=[x.strip() for x in val.split(',') ]
pieces

['a', 'b', 'guido']

In [0]:
#串联回list
','.join(pieces)

'a,b,guido'

In [0]:
#list中查找对象
'a' in val

True

In [0]:
val.index('a')

0

In [0]:
val.find('a') #注意find和index的区别：如果找不到字符串，index将会引发一个异常（find是返回－1）

0

In [0]:
val.count(',')

2

In [0]:
val.replace(',','::')

'a::b::  guido'

###正则表达式
re模块的函数可以分为三个大类：模式匹配、替换以及拆分

In [0]:
import re
text = "foo    bar\t baz  \tqux"
#拆分
re.split('\s+',text)  #描述一个或多个空白符的regex是\s+

['foo', 'bar', 'baz', 'qux']

In [0]:
#可以用re.compile自己编译regex以得到一个可重用的regex对象：
regex=re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [0]:
#模式匹配
#match从字符串开头开始匹配，search只返回符合的第一项，findall返回的是字符串中所有匹配项
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern=r'[A-Z0-9.%+-]+@[A-Z0_9.-]+\.com'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [0]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [0]:
regex.search(text)

In [0]:
print(regex.match(text))

None

In [0]:
#sub方法可以将匹配到的模式替换为指定字符串，并返回所得到的新字符串:
print(regex.sub('xxx@xxx.com',text))

Dave xxx@xxx.com
Steve xxx@xxx.com
Rob xxx@xxx.com
Ryan xxx@xxx.com

In [0]:
#将各个地址分成3个部分：用户名、域名以及域后缀。要实现此功能，只需将待分段的模式的各部分用圆括号包起来即可
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [0]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [0]:
m=regex.findall(text)
m

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [0]:
#sub还能通过诸如\1、\2之类的特殊符号访问各匹配项中的分组。符号\1对应第一个匹配的组，\2对应第二个匹配的组，
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

###pandas的矢量化字符串函数

In [0]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}
data=pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [0]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [0]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [0]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [0]:
data.str.match(pattern, flags=re.IGNORECASE)

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object